<a href="https://colab.research.google.com/github/yoo-minho/colab/blob/main/4_days.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [50]:
import os
import pandas as pd
import numpy as np

# 데이터 폴더 src 변수 할당
base_src = './drive/MyDrive/machine_learning_data'

# friend.csv 파일 src 변수 할당
friend_src = base_src + '/friend.csv' 

# pandas의 read_csv => 데이터 불러오기
df = pd.read_csv(friend_src, encoding='utf-8')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [16]:
# index 2번에 해당하는 row 가져오기
df.iloc[2]

name       Nate
age          30
job     teacher
Name: 2, dtype: object

In [19]:
# coluimn job 에 있는 데이터 가져오기
df['job']

0      student
1    developer
2      teacher
3      dentist
4      manager
5       intern
Name: job, dtype: object

In [27]:
df.iloc[0:3 , :2]

    name  age
0   John   20
1  Jenny   30
2   Nate   30

In [34]:
# 조건 필터링 가져오기 - 30대 이상만 가져오기
df[df['age']<30]

    name  age      job
0   John   20  student
5  Chris   25   intern

In [43]:
# job 이  intern 이면서 30세 초과인 사람 가져오기 (&,|)
df[(df['job'] != 'intern' ) & (df['age'] > 30)]

    name  age      job
3  Julia   40  dentist
4  Brian   45  manager

In [49]:
# 5 in [1,3,4,5,9,23]
df[df['job'].apply(lambda x : x in ['student', 'manager'])]

    name  age      job
0   John   20  student
4  Brian   45  manager

In [58]:
df = pd.DataFrame(np.arange(12).reshape(3,4), columns=['a','b','c','d'])
df

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [63]:
# B,C 컬럼을 삭제하고 싶습니다.
df.drop(['b','c'], axis=1)

   a   d
0  0   3
1  4   7
2  8  11

In [64]:
df = pd.read_csv(friend_src, encoding='utf-8')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [66]:
# df 하나 복사 (원본유지)
temp = df.copy()
temp

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [73]:
temp['age'] = 30
temp.loc[2, 'age'] = 27
temp

    name  age        job
0   John   30    student
1  Jenny   30  developer
2   Nate   27    teacher
3  Julia   30    dentist
4  Brian   30    manager
5  Chris   30     intern